; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_45)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj5 obj6 obj8 obj10 obj11 obj15 obj17 obj18 obj19 obj21 - package
	obj7 obj9 - truck
	obj12 obj13 obj14 obj16 - location
	obj20 - airplane
)

(:init
	(at obj2 obj0)
	(at obj5 obj3)
	(at obj6 obj3)
	(at obj7 obj3)
	(at obj8 obj3)
	(at obj9 obj0)
	(at obj10 obj0)
	(at obj11 obj3)
	(at obj15 obj3)
	(at obj17 obj16)
	(at obj18 obj14)
	(at obj19 obj3)
	(at obj20 obj3)
	(at obj21 obj3)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj12 obj4)
	(in-city obj13 obj1)
	(in-city obj14 obj4)
	(in-city obj16 obj4)
)

(:goal (and
	(at obj2 obj16)
	(at obj5 obj13)
	(at obj6 obj13)
	(at obj8 obj13)
	(at obj10 obj14)
	(at obj11 obj13)
	(at obj15 obj13)
	(at obj17 obj14)
	(at obj18 obj12)
	(at obj19 obj13)
	(at obj21 obj13)
))
)

; plan
1. (drive obj7 obj3 obj14)
   deleted: (at obj7 obj3)
   added: (at obj7 obj14)
   goals met: 0 of 11
2. (drive obj9 obj0 obj13)
   deleted: (at obj9 obj0)
   added: (at obj9 obj13)
   goals met: 0 of 11
3. (load obj20 obj21 obj3)
   deleted: (at obj21 obj3)
   added: (in obj21 obj20)
   goals met: 0 of 11
4. (load obj20 obj8 obj3)
   deleted: (at obj8 obj3)
   added: (in obj8 obj20)
   goals met: 0 of 11
5. (load obj7 obj18 obj14)
   deleted: (at obj18 obj14)
   added: (in obj18 obj7)
   goals met: 0 of 11
6. (unload obj20 obj21 obj3)
   deleted: (in obj21 obj20)
   added: (at obj21 obj3)
   goals met: 0 of 11
7. (unload obj20 obj8 obj3)
   deleted: (in obj8 obj20)
   added: (at obj8 obj3)
   goals met: 0 of 11
8. (drive obj7 obj14 obj12)
   deleted: (at obj7 obj14)
   added: (at obj7 obj12)
   goals met: 0 of 11
9. (drive obj9 obj13 obj0)
   deleted: (at obj9 obj13)
   added: (at obj9 obj0)
   goals met: 0 of 11
10. (load obj20 obj11 obj3)
   deleted: (at obj11 obj3)
   added: (in obj11 obj20)
   goals met: 0 of 11
11. (load obj20 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj20)
   goals met: 0 of 11
12. (load obj20 obj21 obj3)
   deleted: (at obj21 obj3)
   added: (in obj21 obj20)
   goals met: 0 of 11
13. (unload obj7 obj18 obj12)
   deleted: (in obj18 obj7)
   added: (at obj18 obj12)
   goals met: 1 of 11
14. (drive obj7 obj12 obj3)
   deleted: (at obj7 obj12)
   added: (at obj7 obj3)
   goals met: 1 of 11
15. (fly obj20 obj3 obj0)
   deleted: (at obj20 obj3)
   added: (at obj20 obj0)
   goals met: 1 of 11
16. (drive obj7 obj3 obj16)
   deleted: (at obj7 obj3)
   added: (at obj7 obj16)
   goals met: 1 of 11
17. (load obj20 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj20)
   goals met: 1 of 11
18. (load obj20 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj20)
   goals met: 1 of 11
19. (fly obj20 obj0 obj3)
   deleted: (at obj20 obj0)
   added: (at obj20 obj3)
   goals met: 1 of 11
20. (drive obj7 obj16 obj14)
   deleted: (at obj7 obj16)
   added: (at obj7 obj14)
   goals met: 1 of 11
21. (load obj20 obj19 obj3)
   deleted: (at obj19 obj3)
   added: (in obj19 obj20)
   goals met: 1 of 11
22. (load obj20 obj5 obj3)
   deleted: (at obj5 obj3)
   added: (in obj5 obj20)
   goals met: 1 of 11
23. (load obj20 obj6 obj3)
   deleted: (at obj6 obj3)
   added: (in obj6 obj20)
   goals met: 1 of 11
24. (load obj20 obj8 obj3)
   deleted: (at obj8 obj3)
   added: (in obj8 obj20)
   goals met: 1 of 11
25. (unload obj20 obj10 obj3)
   deleted: (in obj10 obj20)
   added: (at obj10 obj3)
   goals met: 1 of 11
26. (unload obj20 obj2 obj3)
   deleted: (in obj2 obj20)
   added: (at obj2 obj3)
   goals met: 1 of 11
27. (fly obj20 obj3 obj0)
   deleted: (at obj20 obj3)
   added: (at obj20 obj0)
   goals met: 1 of 11
28. (drive obj7 obj14 obj12)
   deleted: (at obj7 obj14)
   added: (at obj7 obj12)
   goals met: 1 of 11
29. (drive obj7 obj12 obj3)
   deleted: (at obj7 obj12)
   added: (at obj7 obj3)
   goals met: 1 of 11
30. (load obj7 obj10 obj3)
   deleted: (at obj10 obj3)
   added: (in obj10 obj7)
   goals met: 1 of 11
31. (load obj7 obj2 obj3)
   deleted: (at obj2 obj3)
   added: (in obj2 obj7)
   goals met: 1 of 11
32. (unload obj20 obj11 obj0)
   deleted: (in obj11 obj20)
   added: (at obj11 obj0)
   goals met: 1 of 11
33. (unload obj20 obj15 obj0)
   deleted: (in obj15 obj20)
   added: (at obj15 obj0)
   goals met: 1 of 11
34. (unload obj20 obj19 obj0)
   deleted: (in obj19 obj20)
   added: (at obj19 obj0)
   goals met: 1 of 11
35. (unload obj20 obj21 obj0)
   deleted: (in obj21 obj20)
   added: (at obj21 obj0)
   goals met: 1 of 11
36. (unload obj20 obj5 obj0)
   deleted: (in obj5 obj20)
   added: (at obj5 obj0)
   goals met: 1 of 11
37. (unload obj20 obj6 obj0)
   deleted: (in obj6 obj20)
   added: (at obj6 obj0)
   goals met: 1 of 11
38. (unload obj20 obj8 obj0)
   deleted: (in obj8 obj20)
   added: (at obj8 obj0)
   goals met: 1 of 11
39. (drive obj7 obj3 obj16)
   deleted: (at obj7 obj3)
   added: (at obj7 obj16)
   goals met: 1 of 11
40. (fly obj20 obj0 obj3)
   deleted: (at obj20 obj0)
   added: (at obj20 obj3)
   goals met: 1 of 11
41. (load obj7 obj17 obj16)
   deleted: (at obj17 obj16)
   added: (in obj17 obj7)
   goals met: 1 of 11
42. (load obj9 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj9)
   goals met: 1 of 11
43. (load obj9 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj9)
   goals met: 1 of 11
44. (load obj9 obj19 obj0)
   deleted: (at obj19 obj0)
   added: (in obj19 obj9)
   goals met: 1 of 11
45. (load obj9 obj21 obj0)
   deleted: (at obj21 obj0)
   added: (in obj21 obj9)
   goals met: 1 of 11
46. (load obj9 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj9)
   goals met: 1 of 11
47. (load obj9 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj9)
   goals met: 1 of 11
48. (load obj9 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj9)
   goals met: 1 of 11
49. (unload obj7 obj2 obj16)
   deleted: (in obj2 obj7)
   added: (at obj2 obj16)
   goals met: 2 of 11
50. (drive obj7 obj16 obj14)
   deleted: (at obj7 obj16)
   added: (at obj7 obj14)
   goals met: 2 of 11
51. (drive obj9 obj0 obj13)
   deleted: (at obj9 obj0)
   added: (at obj9 obj13)
   goals met: 2 of 11
52. (unload obj7 obj10 obj14)
   deleted: (in obj10 obj7)
   added: (at obj10 obj14)
   goals met: 3 of 11
53. (unload obj7 obj17 obj14)
   deleted: (in obj17 obj7)
   added: (at obj17 obj14)
   goals met: 4 of 11
54. (unload obj9 obj11 obj13)
   deleted: (in obj11 obj9)
   added: (at obj11 obj13)
   goals met: 5 of 11
55. (unload obj9 obj15 obj13)
   deleted: (in obj15 obj9)
   added: (at obj15 obj13)
   goals met: 6 of 11
56. (unload obj9 obj19 obj13)
   deleted: (in obj19 obj9)
   added: (at obj19 obj13)
   goals met: 7 of 11
57. (unload obj9 obj21 obj13)
   deleted: (in obj21 obj9)
   added: (at obj21 obj13)
   goals met: 8 of 11
58. (unload obj9 obj5 obj13)
   deleted: (in obj5 obj9)
   added: (at obj5 obj13)
   goals met: 9 of 11
59. (unload obj9 obj6 obj13)
   deleted: (in obj6 obj9)
   added: (at obj6 obj13)
   goals met: 10 of 11
60. (unload obj9 obj8 obj13)
   deleted: (in obj8 obj9)
   added: (at obj8 obj13)
   goals met: 11 of 11
